var lang = {
    welcome : `<p>저희 온라인 실험실 방문을 환영합니다. 다음 화면부터 화상 카메라 녹화가 시작됩니다.</p>
    <p>실험을 시작 할 준비가 되셨으면, 아래의 "계속하기" 버튼을 눌러주세요.</p>`,
    welcomeButton: "계속하기",

    permission: `<p>실험 참여가 처음이시라면, 브라우저에서 마이크와 카메라 사용 권한을 요청 할 것입니다.</p>
    <p>"허용" 버튼을 눌러, 본 실험에 필요한 마이크와 카메라가 작동 할 수 있도록 해주세요.</p>
    <p>단, 마이크와 카메라 허용은 본 실험에만 허용된 것으로, 다른 사이트에서는 귀하의 마이크와 카메라에 접근 할 수 없습니다.</p>
    <p>인터넷 브라우저의 팝업을 허용하신 후, 아래의 "계속하기" 버튼을 눌러주세요.</p>`,
    permissionButton: "계속하기",

    startFullscreen: `<p>아래의 "전체화면" 버튼을 눌러 실험 화면을 최대화 해주세요.</p>
    <p>최대화 후 본 사이트는 화상 카메라 녹화를 준비 할 것이며, 몇 분 정도 걸릴 수 있습니다.</p>`,
    startFullscreenButton: "전체화면",

    initCameraTrial: `<p>실험에 참여하는 아동의 눈이 화상 카메라에 선명하게 보이도록 아동의 머리를 배치해주세요.</p>
    <p>아동의 머리가 화면에 보이는 직사각형 가운데에 위치해야 합니다.</p>
    <p>본 실험은 머리가 고정된 상태에서 하는 것이 가장 좋기 때문에 아동이 편안한 자세로 앉도록 해주세요.</p>
    <p>아동의 얼굴이 가운데에 놓이고 직사각형이 녹색으로 바뀌면, "시작" 버튼을 눌러 비디오 재생을 시작 할 수 있습니다.</p>`,
    initCameraTrialButton: "시작",

    startUpload: `<p>귀하의 데이터를 저희에게 전송하시려면 "제출하기" 버튼을 눌러주세요.</p>
    <p>업로드에는 1-2분 가량의 시간이 소요되며, 업로드 후에는 다음 화면으로 자동 이동됩니다. 새로운 화면이 나올때까지 이 화면을 열어두세요.</p>
    <p>인터넷 브라우저에 화상 카메라 아이콘이 계속 표시되어 있지만 녹화는 종료된 상태입니다.</p>`,
    startUploadButton: '제출하기',

    ifUploadSuccessTrial: `<p>귀하의 데이터가 성공적으로 전송 되었습니다. 이제 이 화면을 종료해주세요.</p>
    <p>온라인 실험에 참여해주셔서 대단히 감사합니다!</p> `,

    ifUploadFailTrial1: `<p>데이터 전송 과정에서 기술적인 문제가 발생하였습니다.</p>
    <p>데이터 전송을 계속 하시려면, 아래의 "다운로드" 버튼을 눌러 다음 화면의 지침을 따라주세요.</p>`,
    ifUploadFailTrial1Button: '다운로드',

    ifUploadFailTrial2_1: `<p>방금 다운로드 받으신 파일을 압축하신 뒤, 저희 연구실 이메일로 메일 보내주세요.`,
    ifUploadFailTrial2_2: `. 이제 이 화면을 종료하셔도 됩니다.</p>
    <p>온라인 실험에 참여해주셔서 대단히 감사합니다!</p> `,

    ifUploadFailTrial2_undefined: "(알 수 없는 링크입니다. 연구실 이메일을 통해 연락을 취해주세요.)",
};
